app/Http/Controllers/CartController.php

select * from `products` where `products`.`id` = '1' limit 1
select * from `sizes` where `product_id` = 1 limit 1
---
    public function addtocart(Request $request)
    {

      $pid = $request->product_id;
      $cartProduct = Product::find($pid);
        if ($request->price > 0) {
            Cart::add([
                'id' => $request->product_id,
                'name' => $cartProduct->ProductName,
                'code' => $cartProduct->ProductSku,
                'price' => $request->price,
                'qty' => $request->qty,
                'weight' => 1,
                'image' => $cartProduct->ProductImage,
                'options' => [
                    'size' => $request->size,
                    'color' => $request->color,
                    'sigment' => $request->sigment,
                ],

            ]);
        } else {
            $size = Size::where('product_id', $cartProduct->id)->first();

select * from `products` where `products`.`id` = '2' limit 1
select * from `sizes` where `product_id` = 2 limit 1
select * from `sizes` where `product_id` = 5 limit 1
---
    public function addtobuy(Request $request)
    {

      $pid = $request->product_id;
      $cartProduct = Product::find($pid);
        if ($request->price > 0) {
            Cart::add([
                'id' => $request->product_id,
                'name' => $cartProduct->ProductName,
                'code' => $cartProduct->ProductSku,
                'price' => $request->price,
                'qty' => $request->qty,
                'weight' => 1,
                'image' => $cartProduct->ProductImage,
                'options' => [
                    'size' => $request->size,
                    'color' => $request->color,
                    'sigment' => $request->sigment,
                ],

            ]);
        } else {
            $size = Size::where('product_id', $cartProduct->id)->first();
            $price =$size->SalePrice;
            Cart::add([
                'id' => $request->product_id,
                'name' => $cartProduct->ProductName,
                'code' => $cartProduct->ProductSku,
                'price' => $price,
                'qty' => $request->qty,
                'weight' => 1,
                'image' => $cartProduct->ProductImage,
                'options' => [
                    'size' => $size->size,
                    'color' => $request->color,
                    'sigment' => $request->sigment,
                ],

            ]);