app/Http/Controllers/MainproductController.php

    public function getSubcategory($id)
    {
        // dd($id);
        $subcategories = Subcategory::where('category_id',$id)
                        ->where('status','Active')
                        ->get();
---
select * from `subcategories` where `category_id` = '1' and `status` = 'Active'

    public function storeproduct(Request $request)
    {
        // dd($request->all());
        $mainproduct = new Mainproduct();
        $mainproduct->ProductName = $request->ProductName;
        $mainproduct->category_id = $request->category_id;
        $mainproduct->subcategory_id = $request->subcategory_id;
        $mainproduct->position = $request->position;
        $productImg = $request->ProductImage;
        $time = microtime('.') * 10000;
        if ($productImg) {
            $imgname = $time . $productImg->getClientOriginalName();
            $imguploadPath = ('public/images/product/');
            $productImg->move($imguploadPath, $imgname);
            $productImgUrl = $imguploadPath . $imgname;
            $mainproduct->ProductImage = $productImgUrl;
        }

        $mainproduct->RelatedProductIds = json_encode($request->product);
        $mainproduct->save();
---
insert into `mainproducts` (`ProductName`, `category_id`, `subcategory_id`, `position`, `ProductImage`, `RelatedProductIds`, `ProductSlug`, `updated_at`, `created_at`) values ('rty', '3', '2', '', 'public/images/product/17753712364484product_gallery1-641-20260120052514.jpg', '[{\"productID\":\"1\"}]', 'rty', '2026-04-05 12:40:36', '2026-04-05 12:40:36')

    public function productdata(Request $request)
    {
        Session::put('category_id',$request->category_id);
        if($request->category_id=='all'){
            if(isset($request->code)){
                $products = Mainproduct::where('ProductName', 'LIKE', '%' . $request->code . '%')->orderByRaw('ISNULL(`position`), `position` ASC');
            }else{
                $products = Mainproduct::orderByRaw('ISNULL(`position`), `position` ASC');
            }

        }else{
            if(isset($request->code)){
                $products = Mainproduct::where('category_id',$request->category_id)->where('ProductName', 'LIKE', '%' . $request->code . '%')->orderByRaw('ISNULL(`position`), `position` ASC');
            }else{
                $products = Mainproduct::where('category_id',$request->category_id)->orderByRaw('ISNULL(`position`), `position` ASC');
            }

        }

        return Datatables::of($products)
            ->addColumn('position', function ($products) {
                if(isset($products->position)){
                    return '<div class="d-flex"><input type="text" id="pos'.$products->id.'" value="'. $products->position .'" style="width:60px;"><button type="button" class="btn btn-warning btn-sm btn-position'.$products->id.' ms-2" id="updateposition" data-id="'.$products->id.'"><i class="fa fa-check" aria-hidden="true"></i></button></div>';
                }else{
                    return '<div class="d-flex"><input type="text" id="pos'.$products->id.'" value="" style="width:60px;"><button type="button" class="btn btn-warning btn-sm btn-position'.$products->id.' ms-2" id="updateposition" data-id="'.$products->id.'"><i class="fa fa-check" aria-hidden="true"></i></button></div>';
                }

            })
            ->addColumn('category', function ($products) {
                $cate=Category::where('id', $products->category_id)->first();
                if(isset($cate)){
                    return Category::where('id', $products->category_id)->first()->category_name;
                }else{
                    return '<span style="color:red">Category Deleted</span>';
                }

            })
            ->addColumn('action', function ($products) {
                return '<a href="mainproduct-edit/' . $products->id . '" class="btn btn-primary btn-sm" style="margin-bottom:2px;"><i class="bi bi-pencil-square"></i></a>';
            })
---
select * from `categories` where `id` = 1 limit 1

    public function ratedstatusupdate(Request $request)
    {
        $product = Mainproduct::where('id', $request->product_id)->first();
---
select * from `mainproducts` where `mainproducts`.`id` = '1' limit 1

    public function edit($id)
    {
        $mainproduct = Mainproduct::findOrfail($id);
---
select * from `mainproducts` where `mainproducts`.`id` = '5' limit 1

    public function update(Request $request)
    {
        $mainproduct = Mainproduct::where('id', $request->main_proid)->first();
---
select * from `mainproducts` where `id` = '2' limit 1