app/Http/Controllers/WebviewController.php

    public function subcategoryproduct($slug)
    {
        $subcategorysingle = Subcategory::where('slug', $slug)->first();
        $subcategoryproducts = Mainproduct::where('status', 'Active')->where('subcategory_id', $subcategorysingle->id)->get();
---
select * from `subcategories` where `slug` = 'dropshoulder' limit 1
select * from `mainproducts` where `status` = 'Active' and `subcategory_id` = 2