app/Http/Controllers/WebviewController.php

select `id`, `category_name`, `category_icon`, `slug` from `categories` where `status` = 'Active'
select `id`, `slider_btn_link`, `slider_title`, `slider_image` from `sliders` where `status` = 'Active'
select `id`, `add_link`, `add_image`, `status` from `addbanners` where `status` = 'Active' and `id` in ('1', '2')
select `id`, `add_link`, `add_image`, `status` from `addbanners` where `status` = 'Active' and `id` in ('3', '4')
select `id`, `ProductName`, `ProductSlug`, `ProductImage`, `status`, `position`, `top_rated`, `RelatedProductIds` from `mainproducts` where `status` = 'Active' and `top_rated` = '1' order by ISNULL(`position`), `position` ASC, RAND()
select `id`, `category_name`, `slug`, `position`, `category_image` from `categories` where `status` = 'Active' and `front_status` = 0 order by `position` asc
select `id`, `ProductName`, `ProductSlug`, `ProductImage`, `status`, `position`, `top_rated`, `RelatedProductIds` from `mainproducts` where `status` = 'Active' order by `created_at` desc limit 18
select * from `addbanners` where `status` = 'Active' and `id` in ('1') limit 1
select * from `addbanners` where `status` = 'Active' and `id` in ('2') limit 1
select * from `addbanners` where `status` = 'Active' and `id` in ('3') limit 1
select * from `addbanners` where `status` = 'Active' and `id` in ('4') limit 1
select * from `addbanners` where `status` = 'Active' and `id` in ('5') limit 1
select `id`, `category_id`, `ProductName`, `ProductSlug`, `ProductImage`, `status`, `position`, `top_rated`, `RelatedProductIds` from `mainproducts` where `mainproducts`.`category_id` = 1 and `mainproducts`.`category_id` is not null and `status` = 'Active' order by `position` desc limit 4
select * from `blogs` where `status` = 'Active' order by `created_at` desc
select * from `menus` where `status` = 'Active'
---
    public function mainview()
    {
        $categories = Category::where('status', 'Active')->select('id', 'category_name', 'category_icon', 'slug')->get();
        $sliders = Slider::where('status', 'Active')->select('id', 'slider_btn_link', 'slider_title', 'slider_image')->get();
        $adds = Addbanner::where('status', 'Active')->whereIn('id', ['1', '2'])->select('id', 'add_link', 'add_image', 'status')->get();
        $addbottoms = Addbanner::where('status', 'Active')->whereIn('id', ['3', '4'])->select('id', 'add_link', 'add_image', 'status')->get();

        $topproducts = Mainproduct::where('status', 'Active')->where('top_rated', '1')->orderByRaw('ISNULL(`position`), `position` ASC')->select('id', 'ProductName', 'ProductSlug', 'ProductImage', 'status', 'position', 'top_rated', 'RelatedProductIds')->inRandomOrder()->get();
        $categoryproducts = Category::where('status', 'Active')->where('front_status', 0)->select('id', 'category_name', 'slug', 'position')->orderBy('position')->get();
        $allproducts = Mainproduct::where('status', 'Active')->select('id', 'ProductName', 'ProductSlug', 'ProductImage', 'status', 'position', 'top_rated', 'RelatedProductIds')->latest()->take(18)->get();

        $ad_one = Addbanner::where('status', 'Active')->whereIn('id', ['1'])->first();
        $ad_two = Addbanner::where('status', 'Active')->whereIn('id', ['2'])->first();
        $ad_three = Addbanner::where('status', 'Active')->whereIn('id', ['3'])->first();
        $ad_four = Addbanner::where('status', 'Active')->whereIn('id', ['4'])->first();
        $ad_five = Addbanner::where('status', 'Active')->whereIn('id', ['5'])->first();

        $categoryproducts->each(function ($category) {
            $category->mainproducts = $category->mainproducts()
                ->select('id', 'category_id', 'ProductName', 'ProductSlug', 'ProductImage', 'status', 'position', 'top_rated', 'RelatedProductIds')
                ->where('status', 'Active')
                ->orderBy('position', 'desc')
                ->take(4)
                ->get();
        });
        // return Mainproduct::all();
        $blogs = Blog::where('status','Active')->latest()->get();
        $medias = Menu::where('status', 'Active')->get();

select * from `reviews` where `status` = 'Active'
---
    public function loadreview(Request $request)
    {
        $reviews = Review::where('status', 'Active')->get()->reverse();

select `orders`.*, `customers`.`customerPhone`, `customers`.`customerName`, `customers`.`customerAddress` from `orders` inner join `customers` on `customers`.`order_id` = `orders`.`id` where `user_id` = 1
---
    public function orderhistory()
    {
        $date = \Carbon\Carbon::now();
        $orders =  Order::with(
            [
                'orderproducts' => function ($query) {
                    $query->select('id', 'order_id', 'productName', 'quantity', 'color', 'size');
                },
                'comments' => function ($query) {
                    $query->select('id', 'order_id', 'comment', 'admin_id', 'status', 'created_at')->where('status', 0);
                },
            ]
        )->where('user_id', Auth::guard('web')->user()->id)
            ->join('customers', 'customers.order_id', '=', 'orders.id')
            ->select('orders.*', 'customers.customerPhone', 'customers.customerName', 'customers.customerAddress')
            ->get();

select * from `basicinfos` limit 1
select `id`, `category_id`, `RelatedProductIds` from `mainproducts` where `ProductSlug` = 'as-shabab-panjabi-14' limit 1
select `id`, `product_id`, `Discount`, `RegularPrice`, `SalePrice` from `sizes` where `sizes`.`product_id` in (1) and `status` = 'Active'
select `id`, `product_id`, `Discount`, `RegularPrice`, `SalePrice` from `weights` where `weights`.`product_id` in (1)
select * from `varients` where `product_id` = 1
select `id`, `ProductName`, `ProductSlug`, `ProductImage`, `status`, `position`, `top_rated`, `RelatedProductIds` from `mainproducts` where `category_id` = 1 and `status` = 'Active' order by ISNULL(`position`), `position` ASC, RAND() limit 8
select * from `sizes` where `product_id` = 1 and `status` = 'Active'
select * from `weights` where `product_id` = 1
---
    public function viewproductdetails($slug)
    {
        $shipping =Basicinfo::first();
        $singlemain = Mainproduct::where('ProductSlug', $slug)->select('id', 'category_id', 'RelatedProductIds')->first();
        $id = json_decode($singlemain->RelatedProductIds)[0]->productID;
        $productdetails = Product::with([
            'sizes' => function ($query) {
                $query->select('id', 'product_id', 'Discount', 'RegularPrice', 'SalePrice')->where('status', 'Active');
            },
            'weights' => function ($query) {
                $query->select('id', 'product_id', 'Discount', 'RegularPrice', 'SalePrice');
            }
        ])->where('id', $id)->first();
        $varients = Varient::where('product_id', $productdetails->id)->get();

        $relatedproducts = Mainproduct::where('category_id', $singlemain->category_id)->where('status', 'Active')->orderByRaw('ISNULL(`position`), `position` ASC')->select('id', 'ProductName', 'ProductSlug', 'ProductImage', 'status', 'position', 'top_rated', 'RelatedProductIds')->inRandomOrder()->limit(8)->get();
        $sizesolds = Size::where('product_id', $productdetails->id)->where('status', 'Active')->get();
        $weightolds = Weight::where('product_id', $productdetails->id)->get();

select * from `basicinfos` limit 1
select `id`, `category_id`, `RelatedProductIds` from `mainproducts` where `id` = '1' limit 1
select `id`, `product_id`, `Discount`, `RegularPrice`, `SalePrice` from `sizes` where `sizes`.`product_id` in (1) and `status` = 'Active'
select `id`, `product_id`, `Discount`, `RegularPrice`, `SalePrice` from `weights` where `weights`.`product_id` in (1)
select * from `varients` where `product_id` = 1
select * from `sizes` where `product_id` = 1 and `status` = 'Active'
select * from `weights` where `product_id` = 1
---
    public function loadrelatedpro(Request $request)
    {
        $shipping =Basicinfo::first();
        $singlemain = Mainproduct::where('id', $request->mainproduct_id)->select('id', 'category_id', 'RelatedProductIds')->first();
        $productdetails = Product::with([
            'sizes' => function ($query) {
                $query->select('id', 'product_id', 'Discount', 'RegularPrice', 'SalePrice')->where('status', 'Active');
            },
            'weights' => function ($query) {
                $query->select('id', 'product_id', 'Discount', 'RegularPrice', 'SalePrice');
            }
        ])->where('id', $request->product_id)->first();
        $varients = Varient::where('product_id', $productdetails->id)->get();
        $sizes = Size::where('product_id', $productdetails->id)->where('status', 'Active')->get();
        $weights = Weight::where('product_id', $productdetails->id)->get();

select `id`, `category_name`, `slug`, `status` from `categories` where `slug` = 'punjabi' limit 1
select `id`, `ProductName`, `ProductSlug`, `ProductImage`, `status`, `position`, `RelatedProductIds` from `mainproducts` where `status` = 'Active' and `category_id` = 1 order by ISNULL(`position`), `position` ASC limit 12 offset 0
select count(*) as aggregate from `mainproducts` where `status` = 'Active' and `category_id` = 1
---
    public function categoryproduct($slug)
    {
        $categorysingle = Category::where('slug', $slug)->select('id', 'category_name', 'slug', 'status')->first();
        $categoryproducts = Mainproduct::where('status', 'Active')->where('category_id', $categorysingle->id)->orderByRaw('ISNULL(`position`), `position` ASC')->select('id', 'ProductName', 'ProductSlug', 'ProductImage', 'status', 'position', 'RelatedProductIds')->paginate(12);

select `id`, `category_name`, `slug` from `categories` where `status` = 'Active'
select `id`, `sub_category_name`, `slug`, `category_id`, `status` from `subcategories` where `slug` = 'superior-punjabi' limit 1
select `id`, `sub_category_name`, `slug`, `subcategory_icon`, `status` from `subcategories` where `category_id` = 1
select `id`, `sub_category_name`, `slug`, `category_id`, `position` from `subcategories` where `subcategories`.`category_id` in (1, 2, 3) and `status` = 'Active' order by `position` desc
---
    public function subcategoryproduct($slug)
    {
        $subcategorysingle = Subcategory::where('slug', $slug)->select('id', 'sub_category_name', 'slug', 'category_id', 'status')->first();
        $subcategories = Subcategory::where('category_id', $subcategorysingle->category_id)->select('id', 'sub_category_name', 'slug', 'subcategory_icon', 'status')->get();
        $categories = Category::with(['subcategories' => function ($query) {
            $query->select('id', 'sub_category_name', 'slug', 'category_id', 'position')->where('status', 'Active')->orderby('position', 'desc');
        },])->where('status', 'Active')->select('id', 'category_name', 'slug')->get();

select `id`, `sub_category_name`, `slug`, `status` from `subcategories` where `slug` = 'dropshoulder' limit 1
select * from `products` where `subcategory_id` = 2 and `status` = 'Active' order by `position` desc
---
    public function getsubcategoryproduct(Request $request)
    {
        $subcategory = Subcategory::where('slug', $request->subcategory)->select('id', 'sub_category_name', 'slug', 'status')->first();
        if (isset($request->price_range)) {
            $num = preg_split("/[,]/", $request->price_range);
            $subcategoryproducts = Product::where('subcategory_id', $subcategory->id)->where('status', 'Active')->whereBetween('ProductSalePrice', $num)->orderby('position', 'desc')->get();
        } else {
            $subcategoryproducts = Product::where('subcategory_id', $subcategory->id)->where('status', 'Active')->orderby('position', 'desc')->get();

select `id`, `ProductName`, `ProductSlug`, `ProductImage`, `status`, `position`, `RelatedProductIds` from `mainproducts` where `category_id` = 3 and `status` = 'Active' order by ISNULL(`position`), `position` ASC limit 12 offset 48
select count(*) as aggregate from `mainproducts` where `category_id` = 3 and `status` = 'Active'
---
    public function categoryinfoajax(Request $request)
    {
        $category_id = Session::get('category_id');
        $categoryproducts = Mainproduct::where('category_id', $category_id)->where('status', 'Active')->orderByRaw('ISNULL(`position`), `position` ASC')->select('id', 'ProductName', 'ProductSlug', 'ProductImage', 'status', 'position', 'RelatedProductIds')->paginate(12);

select * from `mainproducts` where `status` = 'Active' and `ProductName` LIKE '%p%'
---
    public function search(Request $request)
    {
        $search = $request->input('search');
        $searchproducts = Mainproduct::where('status', 'Active')
            ->where('ProductName', 'LIKE', "%{$search}%")
            ->get();

select * from `products` where `id` = '1' limit 1
select * from `mainproducts` where `mainproducts`.`id` = '1' limit 1
select `id`, `product_id`, `Discount`, `RegularPrice`, `SalePrice` from `sizes` where `sizes`.`product_id` in (1) and `status` = 'Active'
select `id`, `product_id`, `Discount`, `RegularPrice`, `SalePrice` from `weights` where `weights`.`product_id` in (1)
select * from `varients` where `product_id` = 1
select `id`, `ProductName`, `ProductSlug`, `ProductImage`, `status`, `position`, `top_rated`, `RelatedProductIds` from `mainproducts` where `category_id` = 1 and `status` = 'Active' order by ISNULL(`position`), `position` ASC, RAND() limit 8
select * from `sizes` where `product_id` = 1 and `status` = 'Active'
select * from `weights` where `product_id` = 1
---
    public function quick($id)
    {
        $singlemain = Mainproduct::find($id);
        $id = json_decode($singlemain->RelatedProductIds)[0]->productID;
        $productdetails = Product::with([
            'sizes' => function ($query) {
                $query->select('id', 'product_id', 'Discount', 'RegularPrice', 'SalePrice')->where('status', 'Active');
            },
            'weights' => function ($query) {
                $query->select('id', 'product_id', 'Discount', 'RegularPrice', 'SalePrice');
            }
        ])->where('id', $id)->first();
        $varients = Varient::where('product_id', $productdetails->id)->get();

        $relatedproducts = Mainproduct::where('category_id', $singlemain->category_id)->where('status', 'Active')->orderByRaw('ISNULL(`position`), `position` ASC')->select('id', 'ProductName', 'ProductSlug', 'ProductImage', 'status', 'position', 'top_rated', 'RelatedProductIds')->inRandomOrder()->limit(8)->get();
        $sizesolds = Size::where('product_id', $productdetails->id)->where('status', 'Active')->get();
        $weightolds = Weight::where('product_id', $productdetails->id)->get();