app/Http/Controllers/Backend/OrderController.php

    public function getinfo(Request $request)
    {
        $response['courierpayment'] = DB::table('accounts')->where('form', 'Courier')->whereBetween('date', [$request->infodate, $request->infodateto])->get()->sum('amount');
        $response['officesalepayment'] = DB::table('accounts')->where('form', 'Office Sale')->whereBetween('date', [$request->infodate, $request->infodateto])->get()->sum('amount');
        $response['wholesalepayment'] = DB::table('accounts')->where('form', 'Wholesale')->whereBetween('date', [$request->infodate, $request->infodateto])->get()->sum('amount');
        $response['totalpayment'] = DB::table('accounts')->whereBetween('date', [$request->infodate, $request->infodateto])->get()->sum('amount');
        $response['totalcost'] = DB::table('expenses')->whereBetween('date', [$request->infodate, $request->infodateto])->get()->sum('amount');
        $response['bankcost'] = DB::table('expenses')->where('type', 'Bank Deposit')->whereBetween('date', [$request->infodate, $request->infodateto])->get()->sum('amount');
        $response['officecost'] = DB::table('expenses')->where('type', 'Office Cost')->whereBetween('date', [$request->infodate, $request->infodateto])->get()->sum('amount');
        $response['bostcost'] = DB::table('expenses')->where('type', 'Boost Cost')->whereBetween('date', [$request->infodate, $request->infodateto])->get()->sum('amount');
---
select * from `accounts` where `form` = 'Courier' and `date` between '2026-04-05' and '2026-04-05'
select * from `accounts` where `form` = 'Office Sale' and `date` between '2026-04-05' and '2026-04-05'
select * from `accounts` where `form` = 'Wholesale' and `date` between '2026-04-05' and '2026-04-05'
select * from `accounts` where `date` between '2026-04-05' and '2026-04-05'
select * from `expenses` where `date` between '2026-04-05' and '2026-04-05'
select * from `expenses` where `type` = 'Bank Deposit' and `date` between '2026-04-05' and '2026-04-05'
select * from `expenses` where `type` = 'Office Cost' and `date` between '2026-04-05' and '2026-04-05'
select * from `expenses` where `type` = 'Boost Cost' and `date` between '2026-04-05' and '2026-04-05'

    public function admminiproduct(Request $request)
    {
        $type0 = DB::table('products')->where('ProductSku', 'like', '%' . $request['q'] . '%')->get();
---
select * from `products` where `ProductSku` like '%%'